app/views/users/show.html.erb

<div>
    <% if @user.posts.any? %>
---
SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]