app/views/posts/show.html.erb

  <dt><strong><%= model_class.human_attribute_name(:posted_by) %>:</strong></dt>
  <dd><%= link_to @post.user.first, @post.user %></dd>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]